/*********************************************************
     编程题：四大湖
     
     注意： 总时间限制: 1000ms 内存限制: 65536kB
     
     描述
     
     我国有4大淡水湖。
     
     A说：洞庭湖最大，洪泽湖最小，鄱阳湖第三。
     
     B说：洪泽湖最大，洞庭湖最小，鄱阳湖第二，太湖第三。
     
     C说：洪泽湖最小，洞庭湖第三。
     
     D说：鄱阳湖最大，太湖最小，洪泽湖第二，洞庭湖第三。
     
     已知这4个湖的大小均不相等，4个人每人仅答对一个，
     
     请编程按照鄱阳湖、洞庭湖、太湖、洪泽湖的顺序给出他们的大小排名。
     
     输入
     
     无。
     
     输出
     
     输出为4行，第1行为鄱阳湖的大小名次，从大到小名次分别表示为1、2、3、4；第2、3、4行分别为洞庭湖、太湖、洪泽湖的大小名次。
     
     样例输入
     
     (无)
     样例输出
     
     3
     2
     1
     4
     提示
     
     样例输出仅供格式参考
 ***********************************************************/

#include <iostream>
using namespace std;

int main() {
	int rank[4];
	int sum[4];
	for (rank[0] = 1; rank[0] <= 4; rank[0]++) {
		for (rank[1] = 1; rank[1] <=4; rank[1] ++) {
			if (rank[1] == rank[0]) {
				continue;
			}
			for (rank[2] = 1; rank[2] <=4; rank[2] ++) {
				if (rank[2] == rank[0] || rank[2] == rank[1]) {
					continue;
				}
				rank[3] = 10 - rank[0] - rank[1] - rank[2];
				sum[0] = (rank[0] == 3) + (rank[1] == 1) + (rank[2] == 2) + (rank[3] == 4);
				sum[1] = (rank[0] == 2) + (rank[1] == 4) + (rank[2] == 3) + (rank[3] == 1);
				sum[2] = (rank[1] == 3) + (rank[3] == 4);
				sum[3] = (rank[0] == 1) + (rank[1] == 3) + (rank[2] == 4) + (rank[3] == 2);
				if ((sum[0] == 1) && (sum[1] == 1) && (sum[2] == 1) &&(sum[3] == 1)){
					for (int i = 0; i < 4; i++) {
						cout << rank[i] << endl;
					}
					return 0;
				}

			}
		}
	}
	return 0;
}